#+STARTUP: show2levels
#+PROPERTY: header-args:sh :results output table replace :noweb yes :wrap quote
#+TODO: TODO(t) INPROGRESS(i) XPS(x) AIR(a) PRO(p) | SYNCED(s)
* changelog
** todo states

with the cursor on a header set a todo

#+begin_example
C-c C-t
#+end_example

+ x = xps changes only on dell xps
+ a = air changes pulled on macbook air
+ p = pro changes pulled on macbook pro
+ s = synced

space clears the todo state

** noweb code block

pass in the var path and use eval echo path to expand it

#+NAME: noweb-block
#+begin_src sh 
expanded_path=$(eval echo "${path}") # Force shell expansion
git -C "${expanded_path}" log --pretty=format:'%h, %s, %cd, "%D"' -10 --date=format:'%H:%M:%S/%d-%m-%Y' 
#+end_src

** XPS cerberus

github url

[[https://github.com/NapoleonWils0n/cerberus]]

local git repo

#+begin_src sh
~/git/cerberus
#+end_src

git status

#+NAME: cerberus
#+HEADER: :var path="~/git/cerberus"
#+begin_src sh
<<noweb-block>>
#+end_src

#+RESULTS: cerberus
#+begin_quote
| 0cd151ac | unound root.key              | 18:41:53/07-05-2026 | HEAD -> master, github/master, github/HEAD |
| 5e3de8da | unbound                      | 18:26:36/07-05-2026 |                                            |
| 1fede344 | prime list macbook air       | 19:45:31/06-05-2026 |                                            |
| 0ec4f6af | kld list                     | 19:40:32/06-05-2026 |                                            |
| 3ebd9d00 | freebsd macbook air          | 19:29:54/06-05-2026 |                                            |
| 8a80a14f | debian swappiness            | 16:08:00/06-05-2026 |                                            |
| e4b42238 | debian wifi                  | 16:03:16/06-05-2026 |                                            |
| d21d7f65 | zfs backup                   | 13:51:39/06-05-2026 |                                            |
| f5950978 | podman ubuntu                | 11:35:24/06-05-2026 |                                            |
| 783ef7cd | freebsd mcp-searxng-enhanced | 18:28:28/05-05-2026 |                                            |
#+end_quote

** freebsd
*** dell-xps
**** XPS freebsd-bin-xps

github url

[[https://github.com/NapoleonWils0n/freebsd-bin-xps]]

local path

#+begin_src sh
~/bin
#+end_src

status

#+NAME: freebsd-bin-xps
#+HEADER: :var path="~/bin"
#+begin_src sh
<<noweb-block>>
#+end_src

#+RESULTS: freebsd-bin-xps
#+begin_quote
| a91cd0f | removed back up script            | 14:40:50/07-05-2026 | HEAD -> master, github/master |
| 0f3faf3 | mcp-searxng-enhanced              | 15:19:48/05-05-2026 |                               |
| 4d8e450 | loopback-oss                      | 22:48:12/03-05-2026 |                               |
| 22e0ed1 | dwl                               | 21:48:08/01-05-2026 |                               |
| be7bc9a | vpn script unbound dnscrypt quad9 | 21:10:25/30-04-2026 |                               |
| 28f974e | relay-mpv                         | 20:05:14/27-04-2026 |                               |
| 2ac21ce | adding new version                | 20:05:01/27-04-2026 |                               |
| d742994 | whisper-cli                       | 17:40:40/27-04-2026 |                               |
| 5975828 | ossuary new version               | 20:09:44/25-04-2026 |                               |
| d0fd4a1 | open vpn script                   | 20:31:25/24-04-2026 |                               |
#+end_quote

**** freebsd-dotfiles-xps

github url

[[https://github.com/NapoleonWils0n/freebsd-dotfiles-xps]]

local path

#+begin_src sh
~/git/freebsd/freebsd-dotfiles-xps
#+end_src

status

#+NAME: freebsd-dotfiles-xps
#+HEADER: :var path="~/git/freebsd/freebsd-dotfiles-xps"
#+begin_src sh
<<noweb-block>>
#+end_src

#+RESULTS: freebsd-dotfiles-xps
#+begin_quote
| 1a1c6c5 | freebsd xps org refactored | 00:26:17/07-05-2026 | HEAD -> master, github/master, github/HEAD |
| 9f01628 | obs nvenc                  | 23:52:10/05-05-2026 |                                            |
| c77c07f | emacs                      | 23:40:25/05-05-2026 |                                            |
| 7347347 | emacs mcp                  | 15:54:57/05-05-2026 |                                            |
| 2108425 | emacs mcp                  | 15:18:08/05-05-2026 |                                            |
| 5cf8702 | emacs mcp                  | 21:47:18/04-05-2026 |                                            |
| c8fd2da | mcp                        | 17:08:29/04-05-2026 |                                            |
| 2da7f0f | emacs gptel                | 12:26:46/04-05-2026 |                                            |
| bcb884f | emacs gptel ollama cloud   | 22:38:26/03-05-2026 |                                            |
| e6f3e1a | gemma4                     | 21:34:30/03-05-2026 |                                            |
#+end_quote

**** freebsd-root-xps

github url

[[https://github.com/NapoleonWils0n/freebsd-root-xps]]

local path

#+begin_src sh
~/git/freebsd/freebsd-root-xps
#+end_src

status

#+NAME: freebsd-root-xps
#+HEADER: :var path="~/git/freebsd/freebsd-root-xps"
#+begin_src sh
<<noweb-block>>
#+end_src

#+RESULTS: freebsd-root-xps
#+begin_quote
| 7386de0 | refactored                  | 22:10:14/06-05-2026 | HEAD -> master, github/master |
| 7718054 | freebsd-root-xps refactored | 21:56:52/06-05-2026 |                               |
| 18a2561 | doas podman                 | 15:58:49/05-05-2026 |                               |
| 0a94dea | disable core dumps          | 23:35:03/01-05-2026 |                               |
| 8d6664c | dump                        | 23:33:02/01-05-2026 |                               |
| a7f151c | disable coredumps           | 23:21:50/01-05-2026 |                               |
| 7a68e70 | root                        | 22:59:42/01-05-2026 |                               |
| 0345f3e | unbound                     | 21:38:35/01-05-2026 |                               |
| e2b845c | unbound quad9               | 21:31:04/01-05-2026 |                               |
| 1195602 | unbound quad9               | 21:01:46/01-05-2026 |                               |
#+end_quote

*** macbook-air
**** XPS freebsd-bin-macbook-air

github url

[[https://github.com/NapoleonWils0n/freebsd-bin]]

local path

#+begin_src sh
~/git/freebsd/freebsd-bin
#+end_src

status

#+NAME: freebsd-bin-macbook-air
#+HEADER: :var path="~/git/freebsd/freebsd-bin"
#+begin_src sh
<<noweb-block>>
#+end_src

#+RESULTS: freebsd-bin-macbook-air
#+begin_quote
| 13ed476         | removed dwl rebuild on other machine | 14:44:32/07-05-2026 | HEAD -> master, github/master, github/HEAD |
| 3.891e+51       | removed be back up script            | 14:41:21/07-05-2026 |                                            |
| ffb5673         | freebsd bin macbook air              | 23:44:11/06-05-2026 |                                            |
| cb19519         | freebsd bin macbook air              | 23:43:45/06-05-2026 |                                            |
| 1692412         | freebsd bin                          | 21:10:25/25-04-2026 |                                            |
| acd4e27         | dash-ffmpeg                          | 14:33:20/25-08-2025 |                                            |
| 13c1660         | dash-ffmpeg                          | 12:22:30/25-08-2025 |                                            |
| 2598300000000.0 | dash ffmpeg                          | 18:28:13/23-08-2025 |                                            |
| 6bc803f         | dash-ffmpeg                          | 23:34:40/20-08-2025 |                                            |
| b06855e         | scene-cut-to                         | 20:54:37/06-08-2025 |                                            |
#+end_quote

**** XPS freebsd-dotfiles-macbook-air

github url

[[https://github.com/NapoleonWils0n/freebsd-dotfiles]]

local path

#+begin_src sh
~/git/freebsd/freebsd-dotfiles
#+end_src

status

#+NAME: freebsd-dotfiles-macbook-air
#+HEADER: :var path="~/git/freebsd/freebsd-dotfiles"
#+begin_src sh
<<noweb-block>>
#+end_src

#+RESULTS: freebsd-dotfiles-macbook-air
#+begin_quote
| 0e47d11 | tangled files                | 16:01:17/07-05-2026 | HEAD -> master, github/master, github/HEAD |
| 320374c | mpv                          | 01:12:36/07-05-2026 |                                            |
| a837876 | freebsd dotfiles macbook air | 00:38:41/07-05-2026 |                                            |
| c530460 | removed now playing          | 14:15:43/03-07-2025 |                                            |
| c6f3d9f | emacs exec-path ~/bin        | 23:33:40/17-06-2025 |                                            |
| a360c60 | dired side window            | 18:31:47/31-05-2025 |                                            |
| ac2b270 | dired side window            | 14:46:35/31-05-2025 |                                            |
| e0b4547 | update                       | 14:51:13/28-03-2025 |                                            |
| b59fbe3 | emacs                        | 20:09:01/15-03-2025 |                                            |
| 0b55db7 | emacs removed gemini         | 20:01:39/15-03-2025 |                                            |
#+end_quote

**** XPS freebsd-root-macbook-air

github url

[[https://github.com/NapoleonWils0n/freebsd-root]]

local path

#+begin_src sh
~/git/freebsd/freebsd-root
#+end_src

status

#+NAME: freebsd-root-macbook-air
#+HEADER: :var path="~/git/freebsd/freebsd-root"
#+begin_src sh
<<noweb-block>>
#+end_src

#+RESULTS: freebsd-root-macbook-air
#+begin_quote
| 9a9f9fa | macbook air touchpad working | 20:41:13/07-05-2026 | HEAD -> master, github/master, github/HEAD |
| 6dc8195 | removed pkg repo             | 18:12:49/07-05-2026 |                                            |
| ee31886 | retangled files              | 16:08:14/07-05-2026 |                                            |
| 6dec498 | alfa address                 | 14:30:16/07-05-2026 |                                            |
| 1b81685 | freebsd macbook air          | 23:39:56/06-05-2026 |                                            |
| c4a94d2 | rc.conf                      | 14:46:36/17-04-2025 |                                            |
| 06c4ab5 | virtual oss                  | 20:18:57/04-01-2025 |                                            |
| ac39e53 | lagg tangle permissions      | 19:46:46/28-11-2024 |                                            |
| b43d579 | laggpf                       | 18:56:56/28-11-2024 |                                            |
| d8fa1b8 | loader.conf                  | 20:23:06/24-11-2024 |                                            |
#+end_quote

** debian
*** debian-bin

github url

[[https://github.com/NapoleonWils0n/debian-bin]]

local path

#+begin_src sh
~/git/various-systems/debian/debian-bin
#+end_src

status

#+NAME: debian-bin
#+HEADER: :var path="~/git/various-systems/debian/debian-bin"
#+begin_src sh
<<noweb-block>>
#+end_src

#+RESULTS: debian-bin
#+begin_quote
| d0578d5 | backup script           | 14:22:59/03-05-2026 | HEAD -> master, github/master, github/HEAD |
| de21955 | relay-mpv               | 13:50:34/28-04-2026 |                                            |
| b1b96bc | adding new version      | 13:13:51/28-04-2026 |                                            |
| 75f9866 | syncthing               | 17:29:22/20-04-2026 |                                            |
| 519856b | ossuary                 | 23:00:59/30-03-2026 |                                            |
| 83175c6 | ossuary                 | 15:07:52/29-03-2026 |                                            |
| f77bab0 | wayback machine cdx api | 22:58:13/18-03-2026 |                                            |
| ff295a1 | yt-dlp                  | 13:41:45/18-03-2026 |                                            |
| f36353b | yt-dlp                  | 19:54:19/13-03-2026 |                                            |
| ffeaa2f | unicast                 | 21:28:40/09-03-2026 |                                            |
#+end_quote

*** debian-dotfiles

github url

[[https://github.com/NapoleonWils0n/debian-dotfiles]]

local path

#+begin_src sh
~/git/various-systems/debian/debian-dotfiles
#+end_src

status

#+NAME: debian-dotfiles
#+HEADER: :var path="~/git/various-systems/debian/debian-dotfiles"
#+begin_src sh
<<noweb-block>>
#+end_src

#+RESULTS: debian-dotfiles
#+begin_quote
| a8bfc61 | debian                     | 18:40:07/06-05-2026 | HEAD -> master, github/master, github/HEAD |
| f25ba12 | debian dotfiles            | 18:17:27/06-05-2026 |                                            |
| 17768cb | ollama                     | 11:36:52/06-05-2026 |                                            |
| 06372fe | ollama                     | 17:08:14/04-05-2026 |                                            |
| 9bc0fa1 | emacs gptel                | 12:27:54/04-05-2026 |                                            |
| 29efee5 | emacs gptel gemma4         | 22:40:11/03-05-2026 |                                            |
| 7e7f83d | removed weechat            | 12:27:08/30-04-2026 |                                            |
| 4f215c2 | podman removed n8n craw4ai | 18:33:32/11-04-2026 |                                            |
| 399361  | gptel temprature default   | 18:35:07/10-04-2026 |                                            |
| c0e824b | emacs evil hungry          | 23:50:55/08-04-2026 |                                            |
#+end_quote

*** debian-root

github url

[[https://github.com/NapoleonWils0n/debian-root]]

local path

#+begin_src sh
~/git/various-systems/debian/debian-root
#+end_src

status

#+NAME: debian-root
#+HEADER: :var path="~/git/various-systems/debian/debian-root"
#+begin_src sh
<<noweb-block>>
#+end_src

#+RESULTS: debian-root
#+begin_quote
| 076e4aa | debian root sources  | 17:41:03/13-08-2025 | HEAD -> master, github/master |
| 17fbb66 | removed old scripts  | 14:14:11/27-07-2025 |                               |
| 10ec258 | non-free             | 16:02:50/16-05-2025 |                               |
| ce131c6 | nognome removed      | 14:38:51/16-05-2025 |                               |
| 3a992bd | bin                  | 14:20:00/16-05-2025 |                               |
| cbc2e05 | bin                  | 14:15:21/16-05-2025 |                               |
| 7514afb | debian root          | 21:19:24/15-05-2025 |                               |
| f83c775 | debian dns and dhcp  | 20:58:13/14-03-2017 | mac/master                    |
| 8d99268 | debian root dotfiles | 13:49:16/21-02-2017 |                               |
#+end_quote

